In [36]:
## enumerate함수 :열거하다
## 많은 양의 데이터인 list를 다룰 때 편리하게 쓸 수 있는 기능을 제공
## for-each, for
# for x in list: 리스트에 있는 것을 하나씩 꺼내서 처리하기가 아주 간단
#                    index가 없어서 불편!
#                    하나씩 꺼내서 출력, 연산하기는 용이
#                    리스트에 입력은 안된다.!
# for i in range(n): 리스트의 입력과 출력이 다 됨.
#                    인덱스로 리스트에 있는 값들을 접근해야하기 때문에
#                    코드가 복잡하게 보인다.

In [37]:
num_list = [100, 200, 300]

In [38]:
for x in num_list:
    print(x + 100)

200
300
400

In [39]:
for x in enumerate(num_list):
    print(x)

(0, 100)
(1, 200)
(2, 300)

In [40]:
for x in enumerate(num_list):
    print(x,':',x)

(0, 100) : (0, 100)
(1, 200) : (1, 200)
(2, 300) : (2, 300)

In [41]:
for i, x in enumerate(num_list):
    num_list[i] = x + 100

In [42]:
num_list

[200, 300, 400]

In [43]:
from sklearn.model_selection import KFold

In [44]:
kfold = KFold(n_splits=5)

In [45]:
kfold

KFold(n_splits=5, random_state=None, shuffle=False)

In [46]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [47]:
titanic_df = pd.read_csv('../titanic_train.csv')
titanic_df.head(2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,body,home.dest
0,2,1,"Mellinger, Miss. Madeleine Violet",female,13.0,0,1,250644,19.5,NaN,S,NaN,"England / Bennington, VT"
1,2,1,"Wells, Miss. Joan",female,4.0,1,1,29103,23.0,NaN,S,NaN,"Cornwall / Akron, OH"

In [48]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 915 entries, 0 to 914
Data columns (total 13 columns):
pclass       915 non-null int64
survived     915 non-null int64
name         915 non-null object
sex          915 non-null object
age          740 non-null float64
sibsp        915 non-null int64
parch        915 non-null int64
ticket       915 non-null object
fare         915 non-null float64
cabin        214 non-null object
embarked     913 non-null object
body         85 non-null float64
home.dest    526 non-null object
dtypes: float64(3), int64(4), object(6)
memory usage: 93.1+ KB

In [49]:
# 함수(drop처리)
# name, ticket,body, home.dest
titanic_df = titanic_df.drop(['name', 'ticket', 'body', 'home.dest'], axis=1)
titanic_df

     pclass  survived     sex    age  sibsp  parch     fare cabin embarked
0         2         1  female  13.00      0      1  19.5000   NaN        S
1         2         1  female   4.00      1      1  23.0000   NaN        S
2         2         1  female  30.00      1      0  13.8583   NaN        C
3         3         0    male    NaN      0      0   7.7250   NaN        Q
4         3         1  female  22.00      0      0   7.7250   NaN        Q
..      ...       ...     ...    ...    ...    ...      ...   ...      ...
910       3         1    male    NaN      0      0   7.7750   NaN        S
911       3         1  female   0.17      1      2  20.5750   NaN        S
912       3         0    male    NaN      0      0   8.0500   NaN        S
913       3         1  female    NaN      0      0   7.7333   NaN        Q
914       2         1  female  20.00      0      0  36.7500   NaN        S

[915 rows x 9 columns]

In [50]:
# 함수(na처리)
# na처리
# age는 평균으로 채워주기
# cabin은 n으로 채워주기
# emvarked는 n으로 채워주기 (fillna())
# na 개수가 몇개인지 전체 카운트